



/*
__________________________________________________________________________________________
|                                                                                        |
|                                       Math.E                                           |
|________________________________________________________________________________________| */

// Властивість Math.E представляє основу натурального логарифму, e приблизно дорівнює 2,718.

Math.E // 2.718281828459045











/*
__________________________________________________________________________________________
|                                                                                        |
|                                     Math.LN2                                           |
|________________________________________________________________________________________| */

// Властивість Math.LN2 представляє натуральний логарифм із 2, приблизно рівний 0,693:

Math.LN2 // 0.6931471805599453









/*
__________________________________________________________________________________________
|                                                                                        |
|                                     Math.LN10                                          |
|________________________________________________________________________________________| */

// Властивість Math.LN10 представляє натуральний логарифм з 10 приблизно рівний 2,302:

Math.LN10 // 2.302585092994046












/*
__________________________________________________________________________________________
|                                                                                        |
|                                    Math.LOG2E                                          |
|________________________________________________________________________________________| */

// Властивість Math.LOG2E представляє двійковий логарифм з e приблизно рівний 1,442:


Math.LOG2E // 1.4426950408889634










/*
__________________________________________________________________________________________
|                                                                                        |
|                                   Math.LOG10E                                          |
|________________________________________________________________________________________| */










// Властивість Math.LOG10E представляє десятковий логарифм з e приблизно рівний 0,434:

Math.LOG2E // 0.4342944819032518



/*
__________________________________________________________________________________________
|                                                                                        |
|                                       Math.PI                                          |
|________________________________________________________________________________________| */

// Властивість Math.PI представляє відношення довжини кола до його діаметру, приблизно
//  дорівнює 3,14159:

Math.PI // 3.141592653589793









/*
__________________________________________________________________________________________
|                                                                                        |
|                                  Math.SQRT1_2                                          |
|________________________________________________________________________________________| */


// Властивість Math.SQRT1_2 являє собою квадратний корінь з 1/2, приблизно рівний 0,707:

Math.SQRT1_2 // 0.7071067811865476









/*
__________________________________________________________________________________________
|                                                                                        |
|                                    Math.SQRT2                                          |
|________________________________________________________________________________________| */


// Властивість Math.SQRT2 являє собою квадратний корінь з 2, приблизно рівний 1,414:

Math.SQRT2 // 1.4142135623730951










/*
__________________________________________________________________________________________
|                                                                                        |
|                                    Math.abs()                                          |
|________________________________________________________________________________________| */

/* Math.abs() є методом об'єкта Math у JavaScript, і він використовується для отримання 
абсолютного значення числа. Абсолютне значення числа є числове значення без знака, тобто 
значення, яке завжди позитивно або нуль. */

Math.abs(-5); // 5
Math.abs(3.14); // 3.14
Math.abs(0); // 0










/*
__________________________________________________________________________________________
|                                                                                        |
|                                    Math.floor()                                        |
|________________________________________________________________________________________| */

// Метод Math.floor() - заокруглення вниз. Округлює аргумент до найближчого меншого цілого.

Math.floor( 45.95); //  45
Math.floor(-45.95); // -46

/*






__________________________________________________________________________________________
|                                                                                        |
|                                    Math.ceil()                                         |
|________________________________________________________________________________________| */

// Метод Math.ceil() - заокруглення вверх. Округлює аргумент до найближчого більшого цілого.

Math.ceil(.95);    // 1
Math.ceil(4);      // 4
Math.ceil(7.004);  // 8
Math.ceil(-0.95);  // -0
Math.ceil(-4);     // -4
Math.ceil(-7.004); // -7









/*
__________________________________________________________________________________________
|                                                                                        |
|                                    Math.round()                                        |
|________________________________________________________________________________________| */

// Метод Math.round() повертає число, заокруглене до найближчого цілого.


x = Math.round(20.49); // 20
x = Math.round(20.5); // 21
x = Math.round(-20.5); // -20
x = Math.round(-20.51); // -21









/*
__________________________________________________________________________________________
|                                                                                        |
|                                     Math.sign()                                        |
|________________________________________________________________________________________| */

// Метод Math.sign() повертає знак числа, що вказує на те, чи є число негативним, 
// позитивним чи нулем.

// Зверніть увагу, що аргумент, переданий у цей метод, буде неявно перетворений на число

Math.sign(3);     //  1
Math.sign(-3);    // -1
Math.sign('-3');  // -1
Math.sign(0);     //  0
Math.sign(-0);    // -0
Math.sign(NaN);   // NaN
Math.sign('foo'); // NaN
Math.sign();      // NaN









/*
__________________________________________________________________________________________
|                                                                                        |
|                                     Math.trunc()                                       |
|________________________________________________________________________________________| */


// Функція Math.trunc() повертає цілу частину числа шляхом видалення всіх дробових знаків.
// Аргумент, переданий у цей метод, буде неявно перетворений на число.

Math.trunc(13.37);    // 13
Math.trunc(42.84);    // 42
Math.trunc(0.123);    //  0
Math.trunc(-0.123);   // -0
Math.trunc('-1.123'); // -1
Math.trunc(NaN);      // NaN
Math.trunc('foo');    // NaN
Math.trunc();         // NaN


